envelope.xml

<v:Envelope xmlns:i="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:d="http://www.w3.org/2001/XMLSchema" xmlns:c="http://schemas.xmlsoap.org/soap/encoding/"
	xmlns:v="http://schemas.xmlsoap.org/soap/envelope/">
	<v:Header />
	<v:Body>
		<n0:soma id="o0" c:root="1" xmlns:n0="urn:Calculadora">
			<a i:type="d:int">6</a>
			<b i:type="d:int">9</b>
		</n0:soma>
	</v:Body>
</v:Envelope>